Repository: 777leed/montoring_app
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# rankPlacesTitle
source: Rank Places
ar: الترتيب
fr: Classer les lieux

# loadingText
source: Loading...
ar: جاري التحميل...
fr: Chargement en cours...

# placeStatusText
source: Status:
ar: الحالة:
fr: Statut :

# filterOptionsText
source: Filter Options
ar: خيارات الفلترة
fr: Options de filtrage

# needsFilterText
source: Needs
ar: الاحتياجات
fr: Besoins

# totalPopulationFilterText
source: Total Population
ar: إجمالي السكان
fr: Population totale

# toubkalFilterText
source: Belongs to Toubkal
ar: تابع لـ توبقال
fr: Lié à Toubkal

# damagedHousesFilterText
source: Damaged Houses
ar: المنازل المتضررة
fr: Maisons endommagées

# myHomeTitle
source: Home
ar: الرئيسية
fr: Accueil

# myHomeAdd
source: Add
ar: إضافة
fr: Ajouter

# myHomeProfile
source: Profile
ar: الملف الشخصي
fr: Profil

# myHomeSync
source: Sync
ar: مزامنة
fr: Synchroniser

# signUpText
source: Sign Up
ar: التسجيل
fr: S'inscrire

# nameTextField
source: Name
ar: الاسم
fr: Nom

# signUpButton
source: Sign Up
ar: التسجيل
fr: S'inscrire

# logInText
source: If you already have an account, Please
ar: إذا كان لديك حساب، الرجاء
fr: Si vous avez déjà un compte, veuillez

# logInLink
source: log in
ar: تسجيل الدخول
fr: vous connecter

# emailTextField
source: Email / ID
ar: البريد الإلكتروني / المعرف
fr: E-mail / Identifiant

# passwordTextField
source: Key / Password
ar: المفتاح / كلمة السر
fr: Clé / Mot de passe

# logInButton
source: Log In
ar: تسجيل الدخول
fr: Se connecter

# noAccountText
source: If you don't have an account,
ar: إذا لم يكن لديك حساب الرجاء
fr: Si vous n'avez pas de compte,

# signUpLink
source: Sign Up
ar: التسجيل
fr: S'inscrire

# myProfileTitle
source: my Profile
ar: ملفي
fr: Mon profil

# logoutButton
source: Log Out
ar: تسجيل الخروج
fr: Se déconnecter

# addNewTitle
source: Unavailable
ar: غير متوفر
fr: Ajouter un nouveau titre

# syncPageTitle
source: Unavailable
ar: غير متوفر
fr: Titre de la page de synchronisation

# waterSurveyTitle
source: Water Survey
ar: استطلاع عن المياه
fr: Enquête sur l'eau

# isWaterAvailableQuestion
source: Is water available?
ar: هل تتوفر المياه؟
fr: L'eau est-elle disponible ?

# notAvailableReasonLabel
source: Reason
ar: السبب
fr: Raison de la non-disponibilité

# runningWaterLinkQuestion
source: Are the houses linked with running water?
ar: هل المنازل مرتبطة بمياه الشرب؟
fr: Les maisons sont-elles reliées à l'eau potable ?

# runningWaterSourceQuestion
source: The source of the running water is well
ar: مصدر مياه الشرب هو بئر
fr: La source d'eau potable est-elle un puits ?

# sinksInVillageQuestion
source: Are there any fountains in the village?
ar: هل هناك أي نوافير في القرية ؟
fr: Y a-t-il des éviers dans le village ?

# naturalWaterSourcesQuestion
source: Do people bring water from natural sources?
ar: هل يأتي الناس بالمياه من مصادر طبيعية؟
fr: Les gens se procurent-ils de l'eau à partir de sources naturelles ?

# treesSurveyTitle
source: Trees Survey:
ar: استطلاع عن الأشجار:
fr: Enquête sur les arbres :

# treeTypeLabel
source: Tree Type
ar: نوع الشجرة
fr: Type d'arbre

# treeNumberLabel
source: Number of Trees
ar: عدد الأشجار
fr: Nombre d'arbres

# saveTreesButton
source: Save Trees
ar: حفظ الأشجار
fr: Enregistrer les arbres

# savedTreesTitle
source: Saved Trees:
ar: الأشجار المحفوظة:
fr: Arbres enregistrés :

# roadsSurveyTitle
source: Roads Survey:
ar: استطلاع عن الطرق:
fr: Enquête sur les routes :

# roadNameLabel
source: Road Name
ar: اسم الطريق
fr: Nom de la route

# blockedOption
source: Blocked
ar: مسدود
fr: Bloquée

# demolishedOption
source: Demolished
ar: مهدم
fr: Démolie

# unstableOption
source: Unstable
ar: غير مستقر
fr: Instable

# stableOption
source: Stable
ar: مستقر

# regularCarOption
source: Regular Car
ar: سيارة عادية
fr: Voiture ordinaire

# truckOption
source: Truck
ar: شاحنة
fr: Camion

# motorcycleOption
source: Motorcycle
ar: دراجة نارية
fr: Motocyclette

# muelOption
source: Mule
ar: بغل
fr: Mulet

# byFootOption
source: by foot
ar: سيرًا على الأقدام
fr: À pied

# naOption
source: N/A
ar: غير متوفر
fr: Non disponible

# saveRoadButton
source: Save Road
ar: حفظ الطريق
fr: Enregistrer la route

# savedRoadsTitle
source: Saved Roads:
ar: الطرق المحفوظة:
fr: Routes enregistrées :

# populationSurveyTitle
source: Population Status
ar: حالة السكان
fr: État de la population

# peopleIcon
source: Icons.people
ar: رمز.الناس
fr: Icône de personnes

# generalInfoTitle
source: General Information
ar: معلومات عامة
fr: Informations générales

# currentPopulationTitle
source: Current Population
ar: السكان الحاليين
fr: Population actuelle

# totalDisplacedTitle
source: Total Displaced:
ar: العدد الإجمالي للمشردين :
fr: Total des déplacés :

# enterLabel
source: Enter
ar: إدخال
fr: Entrer

# currentNeedsTitle
source: Current Needs
ar: الاحتياجات الحالية
fr: Besoins actuels

# shoppingBagIcon
source: Icons.shopping_bag
ar: رمز.حقيبة التسوق
fr: Icône de sac de courses

# insertNameLabel
source: Insert name
ar: إدراج الاسم
fr: Insérer le nom

# quantityLabel
source: Quantity
ar: الكمية
fr: Quantité

# commentLabel
source: Comment (optional)
ar: التعليق (اختياري)
fr: Commentaire (facultatif)

# unknownType
source: unknown
ar: غير معروف
fr: Type inconnu

# saveNeedsButton
source: Save Needs
ar: حفظ الاحتياجات
fr: Enregistrer les besoins

# savedItemsTitle
source: Saved Items:
ar: العناصر المحفوظة:
fr: Éléments enregistrés :

# needNameText
source: Need Name:
ar: اسم الحاجة:
fr: Nom du besoin :

# quantityText
source: Quantity:
ar: الكمية:
fr: Quantité :

# needTypeText
source: Need Type:
ar: نوع الحاجة:
fr: Type de besoin :

# dateText
source: Date:
ar: التاريخ:

# commentText
source: Comment:
ar: التعليق:
fr: Commentaire :

# locationSurveyTitle
source: Location Survey
ar: استطلاع عن الموقع
fr: Enquête sur l'emplacement

# villageLabel
source: Village
ar: القرية

# valleyLabel
source: Valley
ar: الوادي
fr: Vallée

# communeLabel
source: Commune
ar: الجماعة

# provinceLabel
source: Province
ar: المقاطعة

# livestockSurveyTitle
source: Livestock Survey
ar: استطلاع عن المواشي
fr: Enquête sur le bétail

# livestockNameLabel
source: Livestock Name
ar: اسم الماشية
fr: Nom du bétail

# livestockNumberLabel
source: Number of Livestock
ar: عدد المواشي
fr: Nombre de bétail

# saveLivestockButton
source: Save Livestock
ar: حفظ الماشية
fr: Enregistrer le bétail

# savedLivestockTitle
source: Saved Livestock:
ar: المواشي المحفوظة:
fr: Bétail enregistré:

# landsSurveyTitle
source: Lands Survey
ar: استطلاع عن الأراضي
fr: Enquête sur les terres

# landSizeLabel
source: Land size in hectares
ar: حجم الأرض بالهكتار
fr: Taille des terres en hectares

# irrigatedLandsLabel
source: Irrigated Lands
ar: الأراضي المروية
fr: Terres irriguées

# barrenLandsLabel
source: Barren Lands
ar: الأراضي القاحلة
fr: Terres stériles

# subsistenceCheckboxLabel
source: Subsistence Farming
ar: الزراعة المعيشية
fr: Subsistance

# financialCheckboxLabel
source: Financial Farming
ar: الزراعة المالية
fr: Financier

# belongsToubkalCheckboxLabel
source: Belongs to Toubkal
ar: تابعة لـ توبقال
fr: Appartient à Toubkal

# irrigationSurveyTitle
source: Irrigation System Survey
ar: استطلاع عن نظام الري
fr: Enquête sur le système d'irrigation

# nameLabel
source: Name of Irrigation System
ar: اسم نظام الري
fr: Nom du système d'irrigation

# purposeLabel
source: Purpose of Irrigation System
ar: غرض نظام الري
fr: Objectif du système d'irrigation

# timingLabel
source: Timing of Irrigation System
ar: توقيت نظام الري
fr: Chronologie du système d'irrigation

# saveButtonLabel
source: Save Irrigation System
ar: حفظ نظام الري
fr: Enregistrer le système d'irrigation

# savedSystemsLabel
source: Saved Irrigation Systems:
ar: أنظمة الري المحفوظة:
fr: Systèmes d'irrigation enregistrés:

# infraSurveyTitle
source: Infrastructure Status
ar: حالة البنية التحتية
fr: État des infrastructures

# homesLabel
source: Homes:
ar: المنازل:
fr: Maisons:

# totalHomesLabel
source: Total Homes
ar: إجمالي المنازل
fr: Total des maisons

# unsafeHomesLabel
source: Total Unsafe / Destroyed Homes
ar: إجمالي المنازل غير الآمنة / المدمرة
fr: Maisons non sécurisées / détruites

# remainingHomesLabel
source: Remaining Homes
ar: المنازل المتبقية
fr: Maisons restantes

# enterFieldHint
source: Enter
ar: إدخال
fr: Entrez

# imageUploadTitle
source: Image Upload:
ar: تحميل الصور:
fr: Télécharger des images:

# noPicturesText
source: No pictures
ar: لا توجد صور
fr: Aucune image

# takePictureButton
source: Take Picture
ar: التقاط صورة
fr: Prendre une photo

# importImagesButton
source: Import Images
ar: استيراد الصور
fr: Importer des images

# herbsSurveyTitle
source: Herbs Survey:
ar: استطلاع عن الأعشاب:
fr: Enquête sur les herbes:

# herbNameInputLabel
source: Herb Name
ar: اسم العشب
fr: Nom de l'herbe

# saveHerbButton
source: Save Herb
ar: حفظ العشب
fr: Enregistrer l'herbe

# savedHerbsText
source: Saved Herbs:
ar: الأعشاب المحفوظة:
fr: Herbes enregistrées:

# craftsSurveyTitle
source: Crafts Survey:
ar: استطلاع عن الحرف اليدوية:
fr: Enquête sur l'artisanat:

# craftTypeInputLabel
source: Craft Type
ar: نوع الحرفة
fr: Type d'artisanat

# menCountInputLabel
source: Number of Men
ar: عدد الرجال
fr: Nombre d'hommes

# womenCountInputLabel
source: Number of Women
ar: عدد النساء
fr: Nombre de femmes

# saveCraftButtonText
source: Save Craft
ar: حفظ الحرفة
fr: Enregistrer l'artisanat

# savedCraftsTitle
source: Saved Crafts:
ar: الحرف المحفوظة:
fr: Artisanat enregistré:

# craftTypeTitle
source: Craft Type
ar: نوع الحرفة
fr: Type d'artisanat

# numberOfMenTitle
source: Number of Men
ar: عدد الرجال
fr: Nombre d'hommes

# numberOfWomenTitle
source: Number of Women
ar: عدد النساء
fr: Nombre de femmes

# contactsBookTitle
source: Contacts book:
ar: دليل الاتصال:
fr: Répertoire des contacts:

# nameInputLabel
source: Name
ar: الاسم
fr: Nom

# phoneNumberInputLabel
source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

# emailInputLabel
source: Email
ar: البريد الإلكتروني

# selectPreferenceHint
source: Select a preference
ar: اختر تفضيل
fr: Sélectionner une préférence

# saveContactButtonText
source: Save Contact
ar: حفظ الاتصال
fr: Enregistrer le contact

# savedContactsTitle
source: Saved Contacts:
ar: جهات الاتصال المحفوظة:
fr: Contacts enregistrés:

# nameTitle
source: Name
ar: الاسم
fr: Nom

# phoneNumberTitle
source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

# emailTitle
source: Email
ar: البريد الإلكتروني

# preferenceTitle
source: Preference
ar: التفضيل
fr: Préférence

# buildingSurveyTitle
source: Building Survey:
ar: استطلاع عن البناء:
fr: Enquête sur la construction:

# buildingTypeInputLabel
source: Building Type
ar: نوع البناء
fr: Type de construction

# conditionLabelText
source: Condition
ar: الحالة
fr: État

# saveBuildingButtonText
source: Save Building
ar: حفظ البناء
fr: Enregistrer la construction

# savedBuildingsTitle
source: Saved Buildings:
ar: المباني المحفوظة:
fr: Bâtiments enregistrés:

# buildingTypeTitle
source: Building Type
ar: نوع البناء
fr: Type de construction

# buildingConditionTitle
source: Building Condition
ar: حالة البناء
fr: État du bâtiment

# workshopsTitle
source: Workshops
ar: ورش العمل
fr: Ateliers

# sustainabilityWorkshopTitle
source: Sustainability Workshop
ar: ورشة الاستدامة
fr: Atelier de durabilité

# groupManagementTitle
source: Group Management
ar: إدارة المجموعة
fr: Gestion de groupe

# businessModelTitle
source: Business Model
ar: نموذج العمل
fr: Modèle d'entreprise

# projectsTitle
source: Projects
ar: المشاريع
fr: Projets

# tassdertSolarPanelsTitle
source: Tassdert Solar Panels
ar: لوحات تصدرت الشمسية
fr: Panneaux solaires Tassdert

# zwinUpActivityITitle
source: Zwin Up Activity I
ar: نشاط زوين أب الأول
fr: Activité Zwin Up I

# zwinUpActivityIITitle
source: Zwin Up Activity II
ar: نشاط زوين أب الثاني
fr: Activité Zwin Up II

# disasterReliefTitle
source: Disaster Relief
ar: مساعدات الكوارث
fr: Secours en cas de catastrophe

# moroccoEarthquakeTitle
source: Morocco Earthquake
ar: زلزال المغرب
fr: Séisme au Maroc

# disasterRecoveryDescription
source: Disaster Recovery for towns and villages impacted by the earthquake
ar: لمساعدة القرى التي تأثرت بالزلزال
fr: Reconstruction des villes et villages touchés par le séisme

# featuresTitle
source: Features
ar: الميزات
fr: Fonctionnalités

# addAreasButton
source: Add Areas
ar: إضافة المناطق
fr: Ajouter des zones

# editAreasButton
source: Edit Areas
ar: تعديل المناطق
fr: Modifier les zones

# exploreButton
source: Explore
ar: استكشاف
fr: Explorer

# rankingAnalysisButton
source: Ranking Analysis
ar: تحليل التصنيف
fr: Analyse de classement

# exportButton
source: Export
ar: استخراج البيانات
fr: Exporter

# homeButton
source: Home
ar: الصفحة الرئيسية
fr: Accueil

# homeText
source: Home
ar: الصفحة الرئيسية
fr: Accueil

# addText
source: Add
ar: إضافة
fr: Ajouter

# profileText
source: Profile
ar: الملف الشخصي
fr: Profil

# syncText
source: Sync
ar: مزامنة
fr: Synchronisation

# dashboardText
source: Dashboard
ar: لوحة القيادة
fr: Tableau de bord

# welcomeAboardText
source: Welcome Aboard!
ar: مرحبا بك !
fr: Bienvenue à bord !

# allText
source: All
ar: الكل
fr: Tout

# disasterText
source: Disaster
ar: المساعدات
fr: Catastrophe

# projectsText
source: Projects
ar: المشاريع
fr: Projets

# workshopsText
source: Workshops
ar: ورش العمل
fr: Ateliers

# emailText
source: Email
ar: البريد الإلكتروني

# locationSearchHint
source: Search
ar: بحث
fr: Recherche

# locationAlreadyAddedMessage
source: Location already added
ar: تمت إضافة الموقع سابقا
fr: L'emplacement a déjà été ajouté

# errorAddingPlaceMessage
source: Error adding place to Firestore:
ar: خطأ في إضافة المكان إلى Firestore:
fr: Erreur lors de l'ajout de l'emplacement à Firestore :

# exploreAreaButtonText
source: Explore Area
ar: استكشاف المنطقة
fr: Explorer la zone

# allAreasButtonText
source: All Areas
ar: جميع المناطق
fr: Toutes les zones

# editAreaButtonText
source: Edit Area
ar: تعديل المنطقة
fr: Modifier la zone

# searchForLocationHint
source: Search For A Location
ar: البحث عن منطقة
fr: Rechercher un emplacement

# selectAnAreaText
source: Select an Area
ar: اختر منطقة
fr: Sélectionner une zone

# currentText
source: Current
ar: الموقع الحالي
fr: Actuel

# searchText
source: Search
ar: بحث
fr: Rechercher

# manualText
source: Manual
ar: يدوي
fr: Manuel

# invalidNameOrTooLong
source: Name Is Empty or Is too long
ar: الاسم فارغ أو طويل جدًا
fr: Nom vide ou trop long

# verifyFieldsText
source: Verify All the fields
ar: تحقق من جميع البيانات
fr: Vérifier tous les champs

source: Location permissions denied
ar: تم رفض أذونات الموقع
fr: Autorisations de localisation refusées

# locationAlreadyAddedText
source: Location already added
ar: تمت إضافة الموقع سابقا
fr: L'emplacement a déjà été ajouté

# currentLocationAddedText
source: Current location added as a marker
ar: تمت إضافة الموقع الحالي
fr: L'emplacement actuel a été ajouté comme marqueur

# treesPageTitle
source: my Trees
ar: أشجاري
fr: Mes arbres

# noTreesAddedText
source: No trees added yet
ar: لم يتم إضافة أشجار بعد
fr: Aucun arbre n'a encore été ajouté

# addTreeText
source: Add Tree
ar: إضافة شجرة
fr: Ajouter un arbre

# typeLabelText
source: Type
ar: النوع

# numberLabelText
source: Number
ar: العدد
fr: Nombre

# treeAddedSuccessText
source: Tree added successfully
ar: تمت إضافة الشجرة بنجاح
fr: Arbre ajouté avec succès

# roadsPageTitle
source: Roads
ar: الطرق
fr: Routes

# noRoadsAddedText
source: No roads added yet
ar: لم يتم إضافة طرق بعد
fr: Aucune route n'a encore été ajoutée

# addRoadText
source: Add Road
ar: إضافة طريق
fr: Ajouter une route

# roadNameLabelText
source: Road Name
ar: اسم الطريق
fr: Nom de la route

# roadStatusLabelText
source: Road Status
ar: حالة الطريق
fr: État de la route

# vehicleTypeLabelText
source: Vehicle Type
ar: نوع المركبة
fr: Type de véhicule

# roadAddedSuccessText
source: Road added successfully
ar: تمت إضافة الطريق بنجاح
fr: Route ajoutée avec succès

# deleteText
source: Delete
ar: حذف
fr: Supprimer

# confirmDeleteMessage
source: Are you sure you want to delete this road?
ar: هل أنت متأكد من أنك تريد الحذف
fr: Êtes-vous sûr de vouloir supprimer cette route ?

# cancelText
source: Cancel
ar: إلغاء
fr: Annuler

# currentLocationAddedSnackbar
source: Current location added as a marker
ar: تمت إضافة الموقع الحالي
fr: L'emplacement actuel a été ajouté comme marqueur

# populationPageTitle
source: Population
ar: السكان

# updateButtonText
source: Update
ar: تحديث
fr: Mettre à jour

# populationUpdatedSnackbar
source: Population updated successfully
ar: تم تحديث السكان بنجاح
fr: Population mise à jour avec succès

# totalPopulationLabelText
source: Total Population
ar: إجمالي السكان
fr: Population totale

# totalFamiliesLabelText
source: Total Number of Families
ar: إجمالي عدد الأسر
fr: Total des familles

# generalInformationText
source: General Information
ar: معلومات عامة
fr: Informations générales

# currentPopulationText
source: Current Population
ar: السكان الحاليين
fr: Population actuelle

# displacedPopulationText
source: Displaced Population
ar: السكان المشردون
fr: Population déplacée

# boysAbove18LabelText
source: Boys Above 18
ar: الأولاد فوق 18
fr: Garçons de plus de 18 ans

# boysUnder18LabelText
source: Boys Under 18
ar: الأولاد تحت 18
fr: Garçons de moins de 18 ans

# girlsAbove18LabelText
source: Girls Above 18
ar: الفتيات فوق 18
fr: Filles de plus de 18 ans

# girlsUnder18LabelText
source: Girls Under 18
ar: الفتيات تحت 18
fr: Filles de moins de 18 ans

# menLabelText
source: Men
ar: الرجال
fr: Hommes

# womenLabelText
source: Women
ar: النساء
fr: Femmes

# currentPopulationSectionTitle
source: Current Population
ar: السكان الحاليين
fr: Population actuelle

# displacedPopulationSectionTitle
source: Displaced Population
ar: السكان المشردون
fr: Population déplacée

# girlsLabelText
source: Girls
ar: الفتيات
fr: Filles

# totalPopulationSubtitle
source: Total:
ar: الإجمالي:

# myNeedsPageTitle
source: my Needs
ar: احتياجاتي
fr: Mes besoins

# addNeedDialogTitle
source: Add Need
ar: إضافة حاجة
fr: Ajouter un besoin

# quantityInputLabelText
source: Quantity
ar: الكمية
fr: Quantité

# needTypeInputLabelText
source: Need Type
ar: نوع الحاجة
fr: Type de besoin

# commentInputLabelText
source: Comment
ar: التعليق
fr: Commentaire

# needAddedSnackbar
source: Need added successfully
ar: تمت إضافة الحاجة بنجاح
fr: Besoin ajouté avec succès

# noNeedsAddedText
source: No needs added yet
ar: لم يتم إضافة احتياجات بعد
fr: Aucun besoin n'a encore été ajouté

# quantityGreaterThanZeroError
source: Quantity must be greater than 0
ar: يجب أن تكون الكمية أكبر من 0
fr: La quantité doit être supérieure à 0

# errorDeletingNeedFirestore
source: Error deleting need in Firestore
ar: خطأ في حذف الاحتياجات في Firestore
fr: Erreur lors de la suppression des besoins dans Firestore

# editLocationPageTitle
source: Edit Location
ar: تعديل المنطقة
fr: Modifier l'emplacement

# placeNameInputLabelText
source: Place Name
ar: اسم المكان
fr: Nom de l'endroit

# latitudeInputLabelText
source: Latitude
ar: خط العرض

# longitudeInputLabelText
source: Longitude
ar: خط الطول

# saveChangesButtonText
source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer les modifications

# livestockPageTitle
source: Livestock
ar: المواشي
fr: Bétail

# noLivestockAddedText
source: No livestock added yet
ar: لم يتم إضافة مواشي بعد
fr: Aucun bétail n'a encore été ajouté

# addLivestockDialogTitle
source: Add Livestock
ar: إضافة مواشي
fr: Ajouter du bétail

# nameInputLabelText
source: Name
ar: الاسم
fr: Nom

# numberInputLabelText
source: Number
ar: العدد
fr: Nombre

# livestockAddedSuccessText
source: Livestock added successfully
ar: تمت إضافة المواشي بنجاح
fr: Bétail ajouté avec succès

# errorDeletingLivestockFirestore
source: Error deleting livestock in Firestore
ar: خطأ في حذف المواشي في Firestore
fr: Erreur lors de la suppression du bétail dans Firestore

# landDetailsPageTitle
source: Land Details
ar: تفاصيل الأرض
fr: Détails des terres

# landSizeLabelText
source: Land Size
ar: حجم الأرض
fr: Taille des terres

# irrigatedLandsLabelText
source: Irrigated Lands
ar: الأراضي المروية
fr: Terres irriguées

# barrenLandsLabelText
source: Barren Lands
ar: الأراضي القاحلة
fr: Terres stériles

# subsistenceLabelText
source: Subsistence Farming
ar: الزراعة المعيشية
fr: Subsistance

# financialLabelText
source: Financial Farming
ar: الزراعة المالية
fr: Financier

# belongsToubkalLabelText
source: Belongs to Toubkal
ar: تنتمي القرية إلى توبقال
fr: Appartient à Toubkal

# villageLabelText
source: Village
ar: القرية

# valleyLabelText
source: Valley
ar: الواد
fr: Vallée

# communeLabelText
source: Commune
ar: الجماعة

# provinceLabelText
source: Province
ar: الإقليم

# landDetailsUpdatedSuccessText
source: Land details updated successfully
ar: تم تحديث تفاصيل الأرض بنجاح
fr: Détails des terres mis à jour avec succès

# errorUpdatingLandDetailsFirestore
source: Error updating land details in Firestore
ar: خطأ في تحديث تفاصيل الأرض في Firestore
fr: Erreur lors de la mise à jour des détails des terres dans Firestore

# irrigationSystemsPageTitle
source: Irrigation Systems
ar: أنظمة الري
fr: Systèmes d'irrigation

# noIrrigationSystemsAddedText
source: No irrigation systems added yet
ar: لم يتم إضافة أنظمة ري بعد
fr: Aucun système d'irrigation n'a encore été ajouté

# addIrrigationSystemTitle
source: Add Irrigation System
ar: إضافة نظام الري
fr: Ajouter un système d'irrigation

# systemNameLabelText
source: System Name
ar: اسم النظام
fr: Nom du système

# purposeLabelText
source: Purpose
ar: الغرض
fr: Objectif

# timingLabelText
source: Timing
ar: التوقيت

# irrigationSystemAddedSuccessText
source: Irrigation System added successfully
ar: تمت إضافة نظام الري بنجاح
fr: Système d'irrigation ajouté avec succès

# errorDeletingIrrigationSystemFirestore
source: Error deleting irrigation system from Firestore
ar: خطأ في حذف نظام الري من Firestore
fr: Erreur lors de la suppression du système d'irrigation dans Firestore

# errorLoadingIrrigationSystemsFirestore
source: Error loading irrigation systems data from Firestore
ar: خطأ في تحميل بيانات أنظمة الري من Firestore
fr: Erreur lors du chargement des données des systèmes d'irrigation depuis Firestore

# waterStatusText
source: Water Status
ar: حالة المياه
fr: Statut de l'eau

# waterSurveyQuestion
source: What's the current status of water ?
ar: ما هو الوضع الحالي للمياه؟

# selectedStatusText
source: Selected Status
ar: الحالة المحددة
fr: Statut sélectionné

# hasRunningWaterText
source: The village has Running Water
ar: القرية بها مياه جارية
fr: Dispose d'eau courante

# hasWellText
source: The village has Well
ar: القرية بها بئر
fr: Dispose d'un puits

# hasSinksText
source: The village has fountains
ar: القرية بها نوافير
fr: Dispose d'éviers

# usesNaturalSourcesText
source: Uses Natural Sources
ar: تستخدم القرية مصادر مياه طبيعية
fr: Utilise des sources naturelles

# isWaterAvailableText
source: Is Water Available
ar: الماء متوفر
fr: L'eau est disponible

# notAvailableReasonText
source: Not Available Reason
ar: سبب عدم توفر الماء
fr: Raison de la non-disponibilité

# electricityNotAvailableReasonText
source: Electricity Not Available Reason
ar: سبب عدم توفر الكهرباء
fr: Raison de la non-disponibilité de l'électricité

# hasInternetText
source: The village has Internet
ar: تتوفر خدمة إنترنت
fr: Dispose d'Internet

# hasSatellitesText
source: The village has Satellites
ar: القرية بها أقمار صناعية
fr: Dispose de satellites

# hasMobileNetworkTowersText
source: The village has Mobile Network Towers
ar: القرية تتوفر فيها أبراج لشبكات الجوّال
fr: Dispose de tours de réseau mobile

# infrastructurePageTitle
source: Infrastructure
ar: البنية التحتية

# totalHomesText
source: Total Homes
ar: إجمالي المنازل
fr: Total des maisons

# totalUnsafeHomesText
source: Total Unsafe / Destroyed Homes
ar: إجمالي المنازل غير الآمنة / المدمرة
fr: Total des maisons non sécurisées / détruites
