Repository: 777leed/montoring_app
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# remainingHomesText
source: Remaining Homes
ar: المنازل المتبقية
fr: Maisons restantes

# electricityStatusText
source: Electricity Status
ar: حالة الكهرباء
fr: Statut de l'électricité

# availableText
source: Available
ar: متاح
fr: Disponible

# notAvailableText
source: Not Available
ar: غير متوفر
fr: Non disponible

# infrastructureUpdatedSuccessText
source: Infrastructure updated successfully
ar: تم تحديث البنية التحتية بنجاح
fr: Infrastructure mise à jour avec succès

# errorUpdatingInfrastructureFirestore
source: Error updating infrastructure in Firestore
ar: خطأ في تحديث البنية التحتية في Firestore
fr: Erreur lors de la mise à jour de l'infrastructure dans Firestore

# errorLoadingInfrastructureFirestore
source: Error loading infrastructure data from Firestore
ar: خطأ في تحميل بيانات البنية التحتية من Firestore
fr: Erreur lors du chargement des données d'infrastructure depuis Firestore

# herbsPageTitle
source: Herbs
ar: الأعشاب
fr: Herbes

# noHerbsAddedText
source: No herbs added yet
ar: لم يتم إضافة أعشاب بعد
fr: Aucune herbe n'a encore été ajoutée

# addHerbDialogTitle
source: Add Herb
ar: إضافة عشبة
fr: Ajouter une herbe

# herbNameLabelText
source: Herb Name
ar: اسم العشبة
fr: Nom de l'herbe

# addButtonText
source: Add
ar: إضافة
fr: Ajouter

# herbAddedSuccessText
source: Herb added successfully
ar: تمت إضافة العشبة بنجاح
fr: Herbe ajoutée avec succès

# errorUpdatingPlaceFirestore
source: Error updating place in Firestore
ar: خطأ في تحديث المكان في Firestore
fr: Erreur lors de la mise à jour du lieu dans Firestore

# errorDeletingHerbFirestore
source: Error deleting herb from Firestore
ar: خطأ في حذف العشبة من Firestore
fr: Erreur lors de la suppression de l'herbe dans Firestore

# errorLoadingHerbsFirestore
source: Error loading herbs data from Firestore
ar: خطأ في تحميل بيانات الأعشاب من Firestore
fr: Erreur lors du chargement des données d'herbes depuis Firestore

source: Home
ar: الصفحة الرئيسية
fr: Accueil

source: Settings
ar: الإعدادات
fr: Paramètres

source: Language
ar: اللغة
fr: Langue

source: Dark Mode
ar: الوضع الداكن
fr: Mode sombre

source: Light Mode
ar: الوضع الفاتح
fr: Mode clair

source: Theme
ar: السمة
fr: Thème

source: Edit
ar: تعديل
fr: Modifier

source: Save
ar: حفظ
fr: Enregistrer

source: Cancel
ar: إلغاء
fr: Annuler

source: Submit
ar: إرسال
fr: Soumettre

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Sign In
ar: تسجيل الدخول
fr: Se connecter

source: Sign Up
ar: التسجيل
fr: S'inscrire

source: Sign Out
ar: تسجيل الخروج
fr: Se déconnecter

source: Welcome
ar: مرحبا
fr: Bienvenue

source: Error
ar: خطأ
fr: Erreur

source: Success
ar: نجاح
fr: Succès

source: Loading
ar: جار التحميل
fr: Chargement

# noData
source: No data available
ar: لا تتوفر بيانات
fr: Aucune donnée

# titleStats
source: Education Statistics
ar: إحصائيات التعليم
fr: Statistiques de l'éducation

source: Add
ar: إضافة
fr: Ajouter

source: Update
ar: تحديث
fr: Mettre à jour

# educationStatisticsUpdated
source: Education statistics updated successfully
ar: تم تحديث إحصائيات التعليم بنجاح
fr: Statistiques de l'éducation mises à jour avec succès

# errorUpdatingEducationStatistics
source: Error updating education statistics in Firestore
ar: خطأ في تحديث إحصائيات التعليم في Firestore
fr: Erreur lors de la mise à jour des statistiques de l'éducation dans Firestore

# errorLoadingEducationStatistics
source: Error loading education statistics data from Firestore
ar: خطأ في تحميل بيانات إحصائيات التعليم من Firestore
fr: Erreur lors du chargement des données de statistiques de l'éducation depuis Firestore

# titleCraft
source: Crafts
ar: الحرف
fr: Artisanat

# noCrafts
source: No crafts added yet
ar: لم يتم إضافة حرف بعد
fr: Aucun artisanat

source: Add Craft
ar: إضافة حرف
fr: Ajouter de l'artisanat

source: Type of Craft
ar: نوع الحرفة
fr: Type d'artisanat

source: Number of Men
ar: عدد الرجال
fr: Nombre d'hommes

source: Number of Women
ar: عدد النساء
fr: Nombre de femmes

# craftAdded
source: Craft added successfully
ar: تمت إضافة الحرفة بنجاح
fr: Artisanat ajouté avec succès

source: Education Statistics
ar: إحصائيات التعليم
fr: Statistiques de l'éducation

source: Literate
ar: المتمدرسين
fr: Alphabétisé

source: Post Graduate
ar: الدراسات العليا
fr: Post-diplômé

source: Baccalaureate
ar: الباكالوريا
fr: Baccalauréat

source: Middle School
ar: الاعدادي
fr: Collège

source: Primary School
ar: الابتدائي
fr: École primaire

source: Illiterate
ar: الغير متمدرسين
fr: Illettré

source: School Availability
ar: توفر المدرسة
fr: Disponibilité scolaire

source: Available
ar: متاح
fr: Disponible

source: Not Available
ar: غير متاح
fr: Non disponible

# title
source: Contacts
ar: جهات الاتصال

# noContacts
source: No contacts added yet
ar: لم يتم إضافة جهات اتصال بعد
fr: Aucun contact

source: Add Contact
ar: إضافة جهة اتصال
fr: Ajouter un contact

source: Name
ar: الاسم
fr: Nom

source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

source: Email
ar: البريد الإلكتروني

source: Contact preference
ar: تفضيل الاتصال
fr: Préférence de contact

# contactAdded
source: Contact added successfully
ar: تمت إضافة جهة الاتصال بنجاح
fr: Contact ajouté avec succès

# titleBuildings
source: Buildings
ar: المباني
fr: Bâtiments

# noBuildings
source: No buildings added yet
ar: لم يتم إضافة مباني بعد
fr: Aucun bâtiment

source: Add Building
ar: إضافة مبنى
fr: Ajouter un bâtiment

source: Building Type
ar: نوع المبنى
fr: Type de bâtiment

source: Condition
ar: الحالة

# buildingAdded
source: Building added successfully
ar: تمت إضافة المبنى بنجاح
fr: Bâtiment ajouté avec succès

# foodType
source: Food
ar: طعام
fr: Nourriture

# hygieneType
source: Hygiene
ar: النظافة
fr: Hygiène

# medicineType
source: Medicine
ar: الطب
fr: Médecine

# constructionType
source: Construction
ar: البناء

# otherType
source: Other
ar: آخر
fr: Autre

# lowText
source: Low
ar: منخفض

# mediumText
source: Medium
ar: متوسط

# highText
source: High
ar: عالي

# unknownText
source: Unknown
ar: غير معروف

# currentNeedsStatusQuestion
source: What's the current needs status of the area?
ar: ما هو الوضع الحالي للحاجات في المنطقة؟
fr: Quel est l'état actuel des besoins de la région?

# pleaseFill
source: Please fill in the information in this survey carefully to assess the current status of the area
ar: يرجى ملء المعلومات في هذا الاستبيان بعناية لتقييم الوضع الحالي للمنطقة
fr: Veuillez remplir soigneusement les informations de cette enquête pour évaluer l'état actuel de la région

# disasterReliefText
source: Disaster Relief Monitoring & Evaluation Survey
ar: استطلاع لمراقبة وتقييم إغاثة الكوارث
fr: Enquête sur la surveillance et l'évaluation des secours en cas de catastrophe

# pleaseInsertDetails
source: Please insert the details below
ar: يرجى إدراج التفاصيل أدناه
fr: Veuillez insérer les détails ci-dessous

# totalHouseholdsText
source: Total Households
ar: إجمالي البيوت
fr: Nombre total de ménages

# boysText
source: Boys
ar: الأولاد
fr: Garçons

# girlsText
source: Girls
ar: البنات
fr: Filles

# electricityAndTelecommunicationText
source: Electricity and Telecommunication
ar: الكهرباء والاتصالات
fr: Électricité et télécommunication

# isElectricityAvailableQuestion
source: Is Electricity available?
ar: هل تتوفر الكهرباء؟
fr: L'électricité est-elle disponible?

# educationSurveyText
source: Education Survey
ar: استطلاع تعليمي
fr: Enquête éducative

# primarySchoolOrKindergartenQuestion
source: Is there any primary school or kindergarten ?
ar: هل هناك مدرسة ابتدائية أو روض؟
fr: Y a-t-il une école primaire ou une maternelle ?

# phoneText
source: Phone
ar: الهاتف
fr: Téléphone

# whatsappText
source: WhatsApp
ar: واتساب

# kindergartenText
source: Kindergarten
ar: روض أطفال
fr: Jardin d'enfants

# schoolText
source: School
ar: مدرسة
fr: École

# storeText
source: Store
ar: متجر
fr: Magasin

# coOpText
source: Co-op
ar: تعاونية
fr: Coopérative

# associationText
source: Association
ar: جمعية

# clinicText
source: Clinic
ar: عيادة
fr: Clinique

# subsistenceFarmingText
source: Subsistence Farming
ar: الزراعة المعيشية
fr: Agriculture de subsistance

# financialFarmingText
source: Financial Farming
ar: الزراعة المالية
fr: Agriculture financière

# galleryText
source: Gallery
ar: المعرض
fr: Galerie

# waterAndElectricityText
source: Water & Electricity
ar: الماء والكهرباء
fr: Eau et électricité

# addCurrentLocationText
source: Add Current Location
ar: إضافة الموقع الحالي
fr: Ajouter l'emplacement actuel

source: Map
ar: الخريطة

# areYouSureDelete
source: Are you sure you want to delete this location from the database ?
ar: هل أنت متأكد من رغبتك في حذف هذا الموقع من قاعدة البيانات؟
fr: Êtes-vous sûr de vouloir supprimer cet emplacement de la base de données ?

# nextText
source: Next
ar: التالي
fr: Suivant

# previousText
source: Previous
ar: سابق
fr: Précédent

# finishText
source: Finish
ar: إنهاء
fr: Finir

# selectPlaceToDelete
source: Select a place to delete
ar: اختر مكانًا للحذف
fr: Sélectionnez un endroit à supprimer

# statusInvalidText
source: Status: Invalid
fr: Statut : invalide
